docs/performance/raw/20260926-a058-329/t20p30-browse200/k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/webhook-under-browse.js
        output: -

     scenarios: (100.00%) 3 scenarios, 3900 max VUs, 1m15s max duration (incl. graceful stop):
              * browse: 200.00 iterations/s for 45s (maxVUs: 300-3000, exec: browseOnce, gracefulStop: 30s)
              * hook: 10.00 iterations/s for 45s (maxVUs: 40-300, exec: webhookOnce, gracefulStop: 30s)
              * pay: 50.00 iterations/s for 45s (maxVUs: 200-600, exec: payOnce, gracefulStop: 30s)


running (0m00.9s), 0069/0540 VUs, 168 complete and 0 interrupted iterations
browse   [   2% ] 0021/0300 VUs  00.9s/45s  200.00 iters/s
hook     [   2% ] 001/040 VUs    00.9s/45s  10.00 iters/s
pay      [   2% ] 046/200 VUs    00.9s/45s  50.00 iters/s

running (0m01.9s), 0080/0540 VUs, 417 complete and 0 interrupted iterations
browse   [   4% ] 0019/0300 VUs  01.9s/45s  200.00 iters/s
hook     [   4% ] 001/040 VUs    01.9s/45s  10.00 iters/s
pay      [   4% ] 060/200 VUs    01.9s/45s  50.00 iters/s

running (0m02.9s), 0091/0540 VUs, 667 complete and 0 interrupted iterations
browse   [   6% ] 0024/0300 VUs  02.9s/45s  200.00 iters/s
hook     [   6% ] 003/040 VUs    02.9s/45s  10.00 iters/s
pay      [   6% ] 064/200 VUs    02.9s/45s  50.00 iters/s

running (0m03.9s), 0077/0540 VUs, 941 complete and 0 interrupted iterations
browse   [   9% ] 0020/0300 VUs  03.9s/45s  200.00 iters/s
hook     [   9% ] 001/040 VUs    03.9s/45s  10.00 iters/s
pay      [   9% ] 056/200 VUs    03.9s/45s  50.00 iters/s

running (0m04.9s), 0088/0540 VUs, 1190 complete and 0 interrupted iterations
browse   [  11% ] 0019/0300 VUs  04.9s/45s  200.00 iters/s
hook     [  11% ] 002/040 VUs    04.9s/45s  10.00 iters/s
pay      [  11% ] 067/200 VUs    04.9s/45s  50.00 iters/s

running (0m05.9s), 0086/0540 VUs, 1451 complete and 0 interrupted iterations
browse   [  13% ] 0017/0300 VUs  05.9s/45s  200.00 iters/s
hook     [  13% ] 002/040 VUs    05.9s/45s  10.00 iters/s
pay      [  13% ] 067/200 VUs    05.9s/45s  50.00 iters/s

running (0m06.9s), 0078/0540 VUs, 1720 complete and 0 interrupted iterations
browse   [  15% ] 0018/0300 VUs  06.9s/45s  200.00 iters/s
hook     [  15% ] 001/040 VUs    06.9s/45s  10.00 iters/s
pay      [  15% ] 059/200 VUs    06.9s/45s  50.00 iters/s

running (0m07.9s), 0077/0540 VUs, 1980 complete and 0 interrupted iterations
browse   [  18% ] 0018/0300 VUs  07.9s/45s  200.00 iters/s
hook     [  18% ] 002/040 VUs    07.9s/45s  10.00 iters/s
pay      [  18% ] 057/200 VUs    07.9s/45s  50.00 iters/s

running (0m08.9s), 0079/0540 VUs, 2238 complete and 0 interrupted iterations
browse   [  20% ] 0020/0300 VUs  08.9s/45s  200.00 iters/s
hook     [  20% ] 001/040 VUs    08.9s/45s  10.00 iters/s
pay      [  20% ] 058/200 VUs    08.9s/45s  50.00 iters/s

running (0m09.9s), 0078/0540 VUs, 2499 complete and 0 interrupted iterations
browse   [  22% ] 0020/0300 VUs  09.9s/45s  200.00 iters/s
hook     [  22% ] 001/040 VUs    09.9s/45s  10.00 iters/s
pay      [  22% ] 057/200 VUs    09.9s/45s  50.00 iters/s

running (0m10.9s), 0078/0540 VUs, 2759 complete and 0 interrupted iterations
browse   [  24% ] 0020/0300 VUs  10.9s/45s  200.00 iters/s
hook     [  24% ] 001/040 VUs    10.9s/45s  10.00 iters/s
pay      [  24% ] 057/200 VUs    10.9s/45s  50.00 iters/s

running (0m11.9s), 0086/0540 VUs, 3011 complete and 0 interrupted iterations
browse   [  26% ] 0020/0300 VUs  11.9s/45s  200.00 iters/s
hook     [  26% ] 001/040 VUs    11.9s/45s  10.00 iters/s
pay      [  26% ] 066/200 VUs    11.9s/45s  50.00 iters/s

running (0m12.9s), 0092/0540 VUs, 3266 complete and 0 interrupted iterations
browse   [  29% ] 0021/0300 VUs  12.9s/45s  200.00 iters/s
hook     [  29% ] 002/040 VUs    12.9s/45s  10.00 iters/s
pay      [  29% ] 069/200 VUs    12.9s/45s  50.00 iters/s

running (0m13.9s), 0085/0540 VUs, 3532 complete and 0 interrupted iterations
browse   [  31% ] 0020/0300 VUs  13.9s/45s  200.00 iters/s
hook     [  31% ] 001/040 VUs    13.9s/45s  10.00 iters/s
pay      [  31% ] 064/200 VUs    13.9s/45s  50.00 iters/s

running (0m14.9s), 0087/0540 VUs, 3792 complete and 0 interrupted iterations
browse   [  33% ] 0022/0300 VUs  14.9s/45s  200.00 iters/s
hook     [  33% ] 001/040 VUs    14.9s/45s  10.00 iters/s
pay      [  33% ] 064/200 VUs    14.9s/45s  50.00 iters/s

running (0m15.9s), 0088/0540 VUs, 4049 complete and 0 interrupted iterations
browse   [  35% ] 0017/0300 VUs  15.9s/45s  200.00 iters/s
hook     [  35% ] 001/040 VUs    15.9s/45s  10.00 iters/s
pay      [  35% ] 070/200 VUs    15.9s/45s  50.00 iters/s

running (0m16.9s), 0087/0540 VUs, 4310 complete and 0 interrupted iterations
browse   [  38% ] 0022/0300 VUs  16.9s/45s  200.00 iters/s
hook     [  38% ] 002/040 VUs    16.9s/45s  10.00 iters/s
pay      [  38% ] 063/200 VUs    16.9s/45s  50.00 iters/s

running (0m17.9s), 0079/0540 VUs, 4578 complete and 0 interrupted iterations
browse   [  40% ] 0019/0300 VUs  17.9s/45s  200.00 iters/s
hook     [  40% ] 002/040 VUs    17.9s/45s  10.00 iters/s
pay      [  40% ] 058/200 VUs    17.9s/45s  50.00 iters/s

running (0m18.9s), 0076/0540 VUs, 4841 complete and 0 interrupted iterations
browse   [  42% ] 0017/0300 VUs  18.9s/45s  200.00 iters/s
hook     [  42% ] 001/040 VUs    18.9s/45s  10.00 iters/s
pay      [  42% ] 058/200 VUs    18.9s/45s  50.00 iters/s

running (0m19.9s), 0075/0540 VUs, 5102 complete and 0 interrupted iterations
browse   [  44% ] 0020/0300 VUs  19.9s/45s  200.00 iters/s
hook     [  44% ] 001/040 VUs    19.9s/45s  10.00 iters/s
pay      [  44% ] 054/200 VUs    19.9s/45s  50.00 iters/s

running (0m20.9s), 0082/0540 VUs, 5355 complete and 0 interrupted iterations
browse   [  46% ] 0020/0300 VUs  20.9s/45s  200.00 iters/s
hook     [  46% ] 001/040 VUs    20.9s/45s  10.00 iters/s
pay      [  46% ] 061/200 VUs    20.9s/45s  50.00 iters/s

running (0m21.9s), 0082/0540 VUs, 5615 complete and 0 interrupted iterations
browse   [  49% ] 0020/0300 VUs  21.9s/45s  200.00 iters/s
hook     [  49% ] 002/040 VUs    21.9s/45s  10.00 iters/s
pay      [  49% ] 060/200 VUs    21.9s/45s  50.00 iters/s

running (0m22.9s), 0091/0540 VUs, 5866 complete and 0 interrupted iterations
browse   [  51% ] 0020/0300 VUs  22.9s/45s  200.00 iters/s
hook     [  51% ] 001/040 VUs    22.9s/45s  10.00 iters/s
pay      [  51% ] 070/200 VUs    22.9s/45s  50.00 iters/s

running (0m23.9s), 0081/0540 VUs, 6136 complete and 0 interrupted iterations
browse   [  53% ] 0020/0300 VUs  23.9s/45s  200.00 iters/s
hook     [  53% ] 001/040 VUs    23.9s/45s  10.00 iters/s
pay      [  53% ] 060/200 VUs    23.9s/45s  50.00 iters/s

running (0m24.9s), 0081/0540 VUs, 6397 complete and 0 interrupted iterations
browse   [  55% ] 0023/0300 VUs  24.9s/45s  200.00 iters/s
hook     [  55% ] 001/040 VUs    24.9s/45s  10.00 iters/s
pay      [  55% ] 057/200 VUs    24.9s/45s  50.00 iters/s

running (0m25.9s), 0082/0540 VUs, 6655 complete and 0 interrupted iterations
browse   [  58% ] 0020/0300 VUs  25.9s/45s  200.00 iters/s
hook     [  58% ] 001/040 VUs    25.9s/45s  10.00 iters/s
pay      [  58% ] 061/200 VUs    25.9s/45s  50.00 iters/s

running (0m26.9s), 0086/0540 VUs, 6911 complete and 0 interrupted iterations
browse   [  60% ] 0019/0300 VUs  26.9s/45s  200.00 iters/s
hook     [  60% ] 004/040 VUs    26.9s/45s  10.00 iters/s
pay      [  60% ] 063/200 VUs    26.9s/45s  50.00 iters/s

running (0m27.9s), 0072/0540 VUs, 7186 complete and 0 interrupted iterations
browse   [  62% ] 0022/0300 VUs  27.9s/45s  200.00 iters/s
hook     [  62% ] 001/040 VUs    27.9s/45s  10.00 iters/s
pay      [  62% ] 049/200 VUs    27.9s/45s  50.00 iters/s

running (0m28.9s), 0081/0540 VUs, 7438 complete and 0 interrupted iterations
browse   [  64% ] 0022/0300 VUs  28.9s/45s  200.00 iters/s
hook     [  64% ] 001/040 VUs    28.9s/45s  10.00 iters/s
pay      [  64% ] 058/200 VUs    28.9s/45s  50.00 iters/s

running (0m29.9s), 0079/0540 VUs, 7698 complete and 0 interrupted iterations
browse   [  66% ] 0019/0300 VUs  29.9s/45s  200.00 iters/s
hook     [  66% ] 001/040 VUs    29.9s/45s  10.00 iters/s
pay      [  66% ] 059/200 VUs    29.9s/45s  50.00 iters/s

running (0m30.9s), 0081/0540 VUs, 7956 complete and 0 interrupted iterations
browse   [  69% ] 0019/0300 VUs  30.9s/45s  200.00 iters/s
hook     [  69% ] 002/040 VUs    30.9s/45s  10.00 iters/s
pay      [  69% ] 060/200 VUs    30.9s/45s  50.00 iters/s

running (0m31.9s), 0080/0540 VUs, 8217 complete and 0 interrupted iterations
browse   [  71% ] 0019/0300 VUs  31.9s/45s  200.00 iters/s
hook     [  71% ] 002/040 VUs    31.9s/45s  10.00 iters/s
pay      [  71% ] 059/200 VUs    31.9s/45s  50.00 iters/s

running (0m32.9s), 0076/0540 VUs, 8481 complete and 0 interrupted iterations
browse   [  73% ] 0019/0300 VUs  32.9s/45s  200.00 iters/s
hook     [  73% ] 001/040 VUs    32.9s/45s  10.00 iters/s
pay      [  73% ] 056/200 VUs    32.9s/45s  50.00 iters/s

running (0m33.9s), 0078/0540 VUs, 8740 complete and 0 interrupted iterations
browse   [  75% ] 0019/0300 VUs  33.9s/45s  200.00 iters/s
hook     [  75% ] 001/040 VUs    33.9s/45s  10.00 iters/s
pay      [  75% ] 058/200 VUs    33.9s/45s  50.00 iters/s

running (0m34.9s), 0077/0540 VUs, 9000 complete and 0 interrupted iterations
browse   [  78% ] 0021/0300 VUs  34.9s/45s  200.00 iters/s
hook     [  78% ] 001/040 VUs    34.9s/45s  10.00 iters/s
pay      [  78% ] 055/200 VUs    34.9s/45s  50.00 iters/s

running (0m35.9s), 0082/0540 VUs, 9255 complete and 0 interrupted iterations
browse   [  80% ] 0019/0300 VUs  35.9s/45s  200.00 iters/s
hook     [  80% ] 002/040 VUs    35.9s/45s  10.00 iters/s
pay      [  80% ] 061/200 VUs    35.9s/45s  50.00 iters/s

running (0m36.9s), 0084/0540 VUs, 9513 complete and 0 interrupted iterations
browse   [  82% ] 0019/0300 VUs  36.9s/45s  200.00 iters/s
hook     [  82% ] 002/040 VUs    36.9s/45s  10.00 iters/s
pay      [  82% ] 063/200 VUs    36.9s/45s  50.00 iters/s

running (0m37.9s), 0083/0540 VUs, 9775 complete and 0 interrupted iterations
browse   [  84% ] 0021/0300 VUs  37.9s/45s  200.00 iters/s
hook     [  84% ] 002/040 VUs    37.9s/45s  10.00 iters/s
pay      [  84% ] 060/200 VUs    37.9s/45s  50.00 iters/s

running (0m38.9s), 0079/0540 VUs, 10038 complete and 0 interrupted iterations
browse   [  86% ] 0018/0300 VUs  38.9s/45s  200.00 iters/s
hook     [  86% ] 001/040 VUs    38.9s/45s  10.00 iters/s
pay      [  86% ] 060/200 VUs    38.9s/45s  50.00 iters/s

running (0m39.9s), 0082/0540 VUs, 10295 complete and 0 interrupted iterations
browse   [  89% ] 0020/0300 VUs  39.9s/45s  200.00 iters/s
hook     [  89% ] 001/040 VUs    39.9s/45s  10.00 iters/s
pay      [  89% ] 061/200 VUs    39.9s/45s  50.00 iters/s

running (0m40.9s), 0071/0540 VUs, 10566 complete and 0 interrupted iterations
browse   [  91% ] 0018/0300 VUs  40.9s/45s  200.00 iters/s
hook     [  91% ] 001/040 VUs    40.9s/45s  10.00 iters/s
pay      [  91% ] 052/200 VUs    40.9s/45s  50.00 iters/s

running (0m41.9s), 0086/0540 VUs, 10811 complete and 0 interrupted iterations
browse   [  93% ] 0020/0300 VUs  41.9s/45s  200.00 iters/s
hook     [  93% ] 001/040 VUs    41.9s/45s  10.00 iters/s
pay      [  93% ] 065/200 VUs    41.9s/45s  50.00 iters/s

running (0m42.9s), 0078/0540 VUs, 11080 complete and 0 interrupted iterations
browse   [  95% ] 0020/0300 VUs  42.9s/45s  200.00 iters/s
hook     [  95% ] 002/040 VUs    42.9s/45s  10.00 iters/s
pay      [  95% ] 056/200 VUs    42.9s/45s  50.00 iters/s

running (0m44.0s), 0078/0540 VUs, 11342 complete and 0 interrupted iterations
browse   [  98% ] 0021/0300 VUs  43.9s/45s  200.00 iters/s
hook     [  98% ] 001/040 VUs    43.9s/45s  10.00 iters/s
pay      [  98% ] 056/200 VUs    43.9s/45s  50.00 iters/s

running (0m44.9s), 0075/0540 VUs, 11602 complete and 0 interrupted iterations
browse   [ 100% ] 0016/0300 VUs  44.9s/45s  200.00 iters/s
hook     [ 100% ] 001/040 VUs    44.9s/45s  10.00 iters/s
pay      [ 100% ] 058/200 VUs    44.9s/45s  50.00 iters/s

running (0m45.9s), 0034/0540 VUs, 11669 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ↓ [ 100% ] 055/200 VUs    45s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<600000' p(95)=5.46s

    http_req_duration{name:webhook}
    ✓ 'p(95)<600000' p(95)=209.73ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.021329/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    browse_2xx.....................: 5322   113.512941/s
    browse_503.....................: 3679   78.469393/s
    browse_ms......................: avg=96.34ms  med=58.37ms  max=680.97ms p(90)=298.12ms p(95)=377.81ms p(99)=496.43ms
    webhook_ms.....................: avg=92.16ms  med=75.27ms  max=426.02ms p(90)=174.93ms p(95)=209.73ms p(99)=312.3ms 
    webhook_over_10s...............: 0.00%  0 out of 451

    HTTP
    http_req_duration..............: avg=258.96ms med=83.89ms  max=5.88s    p(90)=346.04ms p(95)=446.44ms p(99)=5.44s   
      { expected_response:true }...: avg=365.67ms med=102.25ms max=5.88s    p(90)=375.49ms p(95)=519.9ms  p(99)=5.51s   
      { name:confirm }.............: avg=1.1s     med=281.97ms max=5.88s    p(90)=5.37s    p(95)=5.46s    p(99)=5.67s   
      { name:webhook }.............: avg=92.16ms  med=75.27ms  max=426.02ms p(90)=174.93ms p(95)=209.73ms p(99)=312.3ms 
    http_req_failed................: 39.91% 5570 out of 13955
    http_reqs......................: 13955  297.646204/s

    EXECUTION
    iteration_duration.............: avg=309.34ms med=87.14ms  max=6.05s    p(90)=422.32ms p(95)=557.02ms p(99)=5.57s   
    iterations.....................: 11703  249.613295/s
    vus............................: 34     min=34            max=92 
    vus_max........................: 540    min=540           max=540

    NETWORK
    data_received..................: 27 MB  581 kB/s
    data_sent......................: 3.5 MB 75 kB/s



running (0m46.9s), 0000/0540 VUs, 11703 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ✓ [ 100% ] 000/200 VUs    45s  50.00 iters/s